Repository: Pecmecy/FIB-PES
Catalog: ppf_mobile_client/lib/l10n/app_*.arb
Languages: es

# nombre
source: True Name
es: Nombre de verdad

# precioPorPersona
source: True Price Per Person
es: Precio por persona de verdad

# ciudadInicio
source: True Start City
es: Ciudad inicio de verdad

# ciudadDestino
source: True Destination City
es: Ciudad destino de verdad

# plazasLibres
source: True Free Seats
es: Plazas libres de verdad

# eslogan
source: Save, share, and drive towards a greener future
es: Ahorra, comparte y conduce hacia un futuro más verde

source: Log In
es: Iniciar Sessión

source: Sign Up
es: Registrarse

source: My Profile
es: Mi Perfil

source: Ratings
es: Valoraciones

source: Achievements
es: Logros

source: Log Out
es: Cerrar sesión

source: Edit Profile
es: Editar perfil

# isDriver
source: Is a Driver
es: Es un conductor

# noPets
source: No pets in the car
es: No quiero mascotas en el coche

# listenToMusic
source: Listen to music in the car
es: Escucho música en el coche

# noSmoking
source: No smoking in the car
es: No quiero que se fume dentro del coche

# talkTooMuch
source: Talks a lot
es: Hablo mucho

# selectChargerTypes
source: Which types of connectors are compatible with your car?
es: ¿Qué tipos de conectores son compatibles con tu coche?

# selectPreferences
source: What are your preferences?
es: ¿Cuáles son tus preferencias?

# selectAtLeastOneCharger
source: Select at least one type of charger
es: Selecciona al menos un tipo de cargador

# unexpectedError
source: An unexpected error occurred. Please try again later.
es: Ha ocurrido un error inesperado. Por favor, inténtelo de nuevo más tarde.

source: Register as Driver
es: Registrar como Conductor

source: Enter DNI
es: Introduce el DNI

source: Username
es: Nombre de Usuario

source: First Name
es: Nombre

source: Last Name
es: Apellidos

source: Birth Date
es: Fecha de nacimiento

source: Password
es: Contraseña

source: Confirm Password
es: Repita la contraseña

# wantToBeDriver
source: Do you want to be a driver?
es: ¿Quieres ser conductor?

# wantToStopBeingDriver
source: Do you want to stop being a driver?
es: ¿Quieres dejar de ser conductor?

# maxVehicleCapacity
source: Max vehicle capacity (km)
es: Autonomía máxima del vehículo (km)

# passwordsDoNotMatch
source: Please make sure to repeat the password correctly
es: Por favor, asegúrese de que repetir la contraseña correctamente

# fillAllFields
source: Please fill all fields
es: Por favor, completa todos los campos

# enterValidIBAN
source: Please enter a valid IBAN
es: Por favor, introduzca un IBAN válido

source: Save Changes
es: Guardar Cambios

# continueText
source: Continue
es: Continuar

source: Warning!
es: ¡AVISO!

# confirmDeleteProfile
source: Are you sure you want to delete your profile?
es: ¿Estás seguro de que quieres borrar tu perfil?

source: Yes
es: Si

source: Delete Profile
es: Borrar Perfil

source: Recover Password
es: Recuperar Contraseña

source: Email Sent
es: Correo Enviado

# emailSentInstructions
source: An email has been sent to your email address with instructions to reset your password.
es: Se ha enviado un correo a tu dirección de correo electrónico con las instrucciones para restablecer tu contraseña.

source: Send Email
es: Enviar Correo

source: Email
es: Correo Electrónico

# noAccount
source: Don't have an account?
es: ¿No tienes cuenta?

# useDebugUser
source: Or use the
es: O usa el

# invalidCredentials
source: Error: Invalid Credentials
es: Error: Credenciales Inválidas

source: Forgot Password?
es: ¿Has olvidado la contraseña?

source: Charger
es: Cargador

# arrivedTitle
source: Arrived!
es: ¡Llegado!

# arrivedMessage
source: You have arrived at your destination.
es: Has llegado a tu destino.

source: Join Route
es: Unirse a la Ruta

source: No ratings
es: No hay Valoraciones

# loadDriverError
source: Error loading driver information
es: Error al cargar datos del conductor. Por favor, inténtelo de nuevo más tarde.

source: Seats left:
es: Quedan

# seatsLeft2
source: seats left
es: asientos libres

# totalPrice
source: Total price for
es: Importe total para

source: passenger
es: pasajero

source: passengers
es: pasajeros

source: Distance from departure:
es: A

source: Distance from arrival:
es: A

# routeStarted
source: This trip has already started
es: Este viaje ya ha comenzado

# loadPassengerError
source: Error loading passenger information
es: Error al cargar la información del pasajero

# noPassengers
source: No passengers yet
es: Aún no hay pasajeros

# title
source: My Chats
es: Mis Chats

source: Info
es: Información

# noChats
source: You have no active chats
es: No tienes chats activos

# noReviews
source: No reviews available.
es: No hay reseñas disponibles.

source: Average rating
es: Puntuación media

source: Unknown
es: Desconocido

# primeraVez
source: First Time
es: Primera Vez

# finalFeliz
source: Happy Ending
es: Final Feliz

# infiltRuta
source: Route Joiner
es: Infilt Ruta

# criticoEstelar
source: Star Critic
es: Crítico Estelar

# camaleon
source: Chameleon
es: Camaleón

# exploradorDecenal
source: Decennial Explorer
es: Explorador Decenal

# nomadaIntrepido
source: Intrepid Nomad
es: Nómada Intrépido

# arquitectoViajero
source: Traveling Architect
es: Arquitecto Viajero

# maestroDeRutas
source: Route Master
es: Maestro De Rutas

# fechaObtencion
source: Date Obtained
es: Fecha de Obtención

source: Active
es: Activas

source: Finished
es: Finalizadas

source: Driver
es: Conductor

# cannotFollowRoute
source: You cannot follow this route at the moment.
es: No puedes seguir esta ruta en este momento.

# errorLeavingRoute
source: An error occurred while trying to leave the route, please try again later.
es: Ha ocurrido un error al intentar salir de la ruta, inténtelo de nuevo más tarde.

# primeraVezDesc
source: As a virtual path architect, you have taken the first step of a journey by creating your first route.
es: Como arquitecto de caminos virtuales, has iniciado el primer paso de un viaje al crear tu primera ruta.

# finalFelizDesc
source: Persistent and determined, you have reached the end of your route, proving that no destination is too far.
es: Persistente y decidido, has alcanzado el final de tu ruta, demostrando que ningún destino está demasiado lejos.

# infiltRutaDesc
source: Awarded to the adventurer who, seeking shared horizons, has joined someone else's route. A shared journey is a double journey!
es: Otorgado al aventurero que, buscando horizontes compartidos, se ha sumado a la ruta de otro. ¡Un viaje compartido es un viaje doble!

# criticoEstelarDesc
source: If you like something, you applaud it; if you dislike something, you point it out. You have rated a fellow traveler!
es: Si algo te gusta, lo aplaudes; si algo te disgusta, lo señalas. ¡Has conseguido valorar a un compañero de ruta!

# camaleonDesc
source: Like a digital chameleon, you have changed your profile picture. Show the world your true self... or at least your self of the week!
es: Como un camaleón digital, has cambiado tu foto de perfil. ¡Muestra al mundo tu verdadero yo… o al menos tu yo de esta semana!

# exploradorDecenalDesc
source: You have embarked on 10 different journeys, demonstrating your adventurous spirit and willingness to explore new routes.
es: Te has embarcado en 10 viajes distintos, demostrando tu espíritu aventurero y tu disposición para explorar nuevas rutas.

# nomadaIntrepidoDesc
source: With 50 routes under your belt, you have shown exceptional commitment to exploration and adventure. Keep joining more routes!
es: Con 50 rutas bajo tu cinturón, has demostrado un compromiso excepcional con la exploración y la aventura. ¡Sigue uniéndote a más rutas!

# arquitectoViajeroDesc
source: You have designed 10 unique routes, leaving your mark on the world and guiding others on their journeys. Your creativity and vision are commendable!
es: Has diseñado 10 rutas únicas, dejando tu huella en el mundo y guiando a otros en sus viajes. ¡Tu creatividad y visión son dignas de elogio!

# maestroDeRutasDesc
source: You have charted 50 routes, proving to be a true master in path creation. Your contribution is invaluable!
es: Has trazado 50 rutas, demostrando ser un verdadero maestro en la creación de caminos. ¡Tu contribución es inestimable!

source: Pay
es: Pagar

# pleaseEnterCardDetails
source: Please enter your card details
es: Por favor, ingrese los detalles de su tarjeta

# paymentError
source: Error processing payment
es: Error al procesar el pago

# mensaje
source: Message
es: Mensaje

source: Unknown User
es: Usuario desconocido

# comentario
source: Comment:
es: Comentario:

# ingreseComentario
source: Enter your comment here
es: Ingrese su comentario aquí

# calificacionExitosa
source: Rating sent successfully!
es: ¡Calificación enviada con éxito!

# errorCalificacion
source: Error submitting rating
es: Error al enviar la calificación

# errorObtenerId
source: Could not obtain user ID
es: No se pudo obtener el ID del usuario

# enviar
source: Submit
es: Enviar

# correoElectronico
source: Email
es: Correo electrónico

# nombreUsuario
source: Username
es: Nombre de Usuario

# contrasena
source: Password
es: Contraseña

# repetirContrasena
source: Repeat password
es: Repita la contraseña

# fechaNacimiento
source: Date of birth
es: Fecha de nacimiento

# quieresSerConductor
source: Do you want to be a driver?
es: ¿Quieres ser conductor?

# autonomiaVehiculo
source: Maximum vehicle range (km)
es: Autonomia máxima del vehículo (km)

# apellidos
source: Last name
es: Apellidos

# registrarse
source: Register
es: Registrarse

# errorRepetirContrasena
source: Please make sure to repeat the password correctly
es: Por favor, asegúrese de que repetir la contraseña correctamente

# errorCorreoElectronico
source: Please enter a valid email address
es: Por favor, introduzca una dirección de correo electrónico válida

# errorCompletarCampos
source: Please complete all fields
es: Por favor, completa todos los campos

# errorDniNie
source: Please enter a valid DNI/NIE
es: Por favor, introduzca un DNI/NIE válido

# errorIban
source: Please enter a valid IBAN
es: Por favor, introduzca un IBAN válido

# errorRegistro
source: An unexpected error occurred. Please try again later
es: Ha ocurrido un error inesperado. Por favor, inténtelo de nuevo más tarde

# cancelar
source: Cancel
es: Cancelar

# seleccionar
source: Select
es: Seleccionar

# errorFormatoFecha
source: Date of birth format error
es: Error de formato al introducir la fecha de nacimiento

# errorFechaInvalida
source: Invalid date of birth
es: Error de fecha de nacimiento inválida

# motivoReporte
source: Reason for reporting:
es: Motivo del reporte:

# ingreseMotivoReporte
source: Enter the reason for reporting here
es: Ingrese el motivo del reporte aquí

# reporteExitoso
source: Report sent successfully!
es: ¡Reporte enviado con éxito!

# errorReporte
source: Error sending the report
es: Error al enviar el reporte

# errorObtenerIdUsuario
source: Could not obtain user ID
es: No se pudo obtener el ID del usuario

# reportarUsuario
source: Report User
es: Reportar Usuario

# salida
source: Departure
es: Salida

# destino
source: Destination
es: Destino

# posicionActual
source: Current Position
es: Posición Actual

# precio
source: Price
es: Precio

# crearRuta
source: Create Route
es: Crear Ruta

# errorConexionServidor
source: Error connecting to the server, please try again later
es: Error al conectar con el servidor, por favor, inténtelo de nuevo más tarde

# errorDireccionInvalida
source: We couldn't find a valid address with that name
es: No hemos podido encontrar una dirección válida con ese nombre

# errorPisandoFrancia
source: I'm sorry you have to step on France
es: Siento mucho que tengas que pisar Francia

# servicioUbicacionDeshabilitado
source: Location services are disabled.
es: Los servicios de ubicación están deshabilitados.

# permisosUbicacionDenegados
source: Location permissions are denied
es: Permisos de ubicación denegados

# permisosUbicacionDenegadosPermanentemente
source: Location permissions are permanently denied, we cannot request permissions.
es: Los permisos de ubicación están permanentemente denegados, no podemos solicitar permisos.

# relleneTodosLosCampos
source: Please fill in all the fields, and make sure the addresses are correct
es: Por favor, rellene todos los campos, y asegúrese de que las direcciones son correctas

# errorAutonomiaVehiculo
source: We couldn't find a route between the selected points that fits your vehicle's range
es: No hemos podido encontrar una ruta entre los puntos seleccionados que se adapte a la autonomía de su vehículo

# errorCrearRuta
source: Error creating the route, please try again later
es: Error al crear la ruta, por favor, inténtelo de nuevo más tarde

# errorRutaSeleccionada
source: We couldn't find a route between the selected points
es: No se ha podido encontrar una ruta entre los puntos seleccionados

source: Order Selector
es: Selector de Orden

source: Time
es: Tiempo

source: Price
es: Precio

source: Departure Distance
es: Distancia de Salida

source: Destination Distance
es: Distancia de Destino

# verViajes
source: View Trips
es: Ver Viajes

# pasajero
source: passenger
es: pasajero

# pasajeros
source: passengers
es: pasajeros

# ordenar
source: Order
es: Ordenar

# noRutasEncontradas
source: No routes found
es: No se han encontrado rutas

# de
source: From
es: De

# a
source: To
es: A

# buscar
source: Search
es: Buscar

# ubicacionError
source: We couldn't get your location
es: No hemos podido obtener tu ubicación

# camposError
source: Please fill out all fields
es: Por favor, rellene todos los campos

# direccionError
source: Please enter a valid address
es: Por favor, introduzca una dirección válida

# fechaSalida
source: Departure date
es: Fecha de salida

# hoy
source: Today
es: Hoy

# buscarLugar
source: Search place
es: Busca un lugar

# confirmChangeToDriver
source: Are you sure you want to change your role to driver? Changing your role to driver will automatically remove you from the routes you are registered for as a passenger, and you will need to log in again.
es: ¿Está seguro de que quiere cambiar su rol a conductor? Cambiar su rol a conductor causará la salida automática de las rutas en las que se encuentre inscrito como pasajero, y tendrá que volver a iniciar sesión.

# confirmChangeToUser
source: Are you sure you want to stop being a driver? Changing your role will automatically remove you from the routes you are registered for as a passenger, delete the routes you have created, and you will need to log in again.
es: ¿Está seguro de que quiere dejar de ser conductor? Cambiar su rol causará la salida automática de las rutas en las que se encuentre inscrito como pasajero, la eliminación de las rutas que haya creado, y tendrá que volver a iniciar sesión
